MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512GM706/mcu.h
#define _CNEND_CNIED8_POSITION                   0x00000008
#define _CNEND_CNIED8_MASK                       0x00000100
#define _CNEND_CNIED8_LENGTH                     0x00000001

#define _CNPUD_CNPUD5_POSITION                   0x00000005
#define _CNPUD_CNPUD5_MASK                       0x00000020
#define _CNPUD_CNPUD5_LENGTH                     0x00000001

#define _CNPUD_CNPUD6_POSITION                   0x00000006
#define _CNPUD_CNPUD6_MASK                       0x00000040
#define _CNPUD_CNPUD6_LENGTH                     0x00000001

#define _CNPUD_CNPUD8_POSITION                   0x00000008
#define _CNPUD_CNPUD8_MASK                       0x00000100
#define _CNPUD_CNPUD8_LENGTH                     0x00000001

#define _CNPDD_CNPDD5_POSITION                   0x00000005
#define _CNPDD_CNPDD5_MASK                       0x00000020
#define _CNPDD_CNPDD5_LENGTH                     0x00000001

#define _CNPDD_CNPDD6_POSITION                   0x00000006
#define _CNPDD_CNPDD6_MASK                       0x00000040
#define _CNPDD_CNPDD6_LENGTH                     0x00000001

#define _CNPDD_CNPDD8_POSITION                   0x00000008
#define _CNPDD_CNPDD8_MASK                       0x00000100
#define _CNPDD_CNPDD8_LENGTH                     0x00000001

#define _TRISE_TRISE12_POSITION                  0x0000000C
#define _TRISE_TRISE12_MASK                      0x00001000
#define _TRISE_TRISE12_LENGTH                    0x00000001

#define _TRISE_TRISE13_POSITION                  0x0000000D
#define _TRISE_TRISE13_MASK                      0x00002000
#define _TRISE_TRISE13_LENGTH                    0x00000001

#define _TRISE_TRISE14_POSITION                  0x0000000E
#define _TRISE_TRISE14_MASK                      0x00004000
#define _TRISE_TRISE14_LENGTH                    0x00000001

#define _TRISE_TRISE15_POSITION                  0x0000000F
#define _TRISE_TRISE15_MASK                      0x00008000
#define _TRISE_TRISE15_LENGTH                    0x00000001

#define _PORTE_RE12_POSITION                     0x0000000C
#define _PORTE_RE12_MASK                         0x00001000
#define _PORTE_RE12_LENGTH                       0x00000001

#define _PORTE_RE13_POSITION                     0x0000000D
#define _PORTE_RE13_MASK                         0x00002000
#define _PORTE_RE13_LENGTH                       0x00000001

#define _PORTE_RE14_POSITION                     0x0000000E
#define _PORTE_RE14_MASK                         0x00004000
#define _PORTE_RE14_LENGTH                       0x00000001

#define _PORTE_RE15_POSITION                     0x0000000F
#define _PORTE_RE15_MASK                         0x00008000
#define _PORTE_RE15_LENGTH                       0x00000001

#define _LATE_LATE12_POSITION                    0x0000000C
#define _LATE_LATE12_MASK                        0x00001000
#define _LATE_LATE12_LENGTH                      0x00000001

#define _LATE_LATE13_POSITION                    0x0000000D
#define _LATE_LATE13_MASK                        0x00002000
#define _LATE_LATE13_LENGTH                      0x00000001

#define _LATE_LATE14_POSITION                    0x0000000E
#define _LATE_LATE14_MASK                        0x00004000
#define _LATE_LATE14_LENGTH                      0x00000001

#define _LATE_LATE15_POSITION                    0x0000000F
#define _LATE_LATE15_MASK                        0x00008000
#define _LATE_LATE15_LENGTH                      0x00000001

#define _ODCE_ODCE12_POSITION                    0x0000000C
#define _ODCE_ODCE12_MASK                        0x00001000
#define _ODCE_ODCE12_LENGTH                      0x00000001

#define _ODCE_ODCE13_POSITION                    0x0000000D
#define _ODCE_ODCE13_MASK                        0x00002000
#define _ODCE_ODCE13_LENGTH                      0x00000001

#define _ODCE_ODCE14_POSITION                    0x0000000E
#define _ODCE_ODCE14_MASK                        0x00004000
#define _ODCE_ODCE14_LENGTH                      0x00000001

#define _ODCE_ODCE15_POSITION                    0x0000000F
#define _ODCE_ODCE15_MASK                        0x00008000
#define _ODCE_ODCE15_LENGTH                      0x00000001

#define _CNENE_CNIEE12_POSITION                  0x0000000C
#define _CNENE_CNIEE12_MASK                      0x00001000
#define _CNENE_CNIEE12_LENGTH                    0x00000001

#define _CNENE_CNIEE13_POSITION                  0x0000000D
#define _CNENE_CNIEE13_MASK                      0x00002000
#define _CNENE_CNIEE13_LENGTH                    0x00000001

#define _CNENE_CNIEE14_POSITION                  0x0000000E
#define _CNENE_CNIEE14_MASK                      0x00004000
#define _CNENE_CNIEE14_LENGTH                    0x00000001

#define _CNENE_CNIEE15_POSITION                  0x0000000F
#define _CNENE_CNIEE15_MASK                      0x00008000
#define _CNENE_CNIEE15_LENGTH                    0x00000001

#define _CNPUE_CNPUE12_POSITION                  0x0000000C
#define _CNPUE_CNPUE12_MASK                      0x00001000
#define _CNPUE_CNPUE12_LENGTH                    0x00000001

#define _CNPUE_CNPUE13_POSITION                  0x0000000D
#define _CNPUE_CNPUE13_MASK                      0x00002000
#define _CNPUE_CNPUE13_LENGTH                    0x00000001

#define _CNPUE_CNPUE14_POSITION                  0x0000000E
#define _CNPUE_CNPUE14_MASK                      0x00004000
#define _CNPUE_CNPUE14_LENGTH                    0x00000001

#define _CNPUE_CNPUE15_POSITION                  0x0000000F
#define _CNPUE_CNPUE15_MASK                      0x00008000
#define _CNPUE_CNPUE15_LENGTH                    0x00000001

#define _CNPDE_CNPDE12_POSITION                  0x0000000C
#define _CNPDE_CNPDE12_MASK                      0x00001000
#define _CNPDE_CNPDE12_LENGTH                    0x00000001

#define _CNPDE_CNPDE13_POSITION                  0x0000000D
#define _CNPDE_CNPDE13_MASK                      0x00002000
#define _CNPDE_CNPDE13_LENGTH                    0x00000001

#define _CNPDE_CNPDE14_POSITION                  0x0000000E
#define _CNPDE_CNPDE14_MASK                      0x00004000
#define _CNPDE_CNPDE14_LENGTH                    0x00000001

#define _CNPDE_CNPDE15_POSITION                  0x0000000F
#define _CNPDE_CNPDE15_MASK                      0x00008000
#define _CNPDE_CNPDE15_LENGTH                    0x00000001

